DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
/**
 * @file lh2.c
 * @addtogroup BSP
 *
 * @brief  nRF52833-specific definition of the "lh2" bsp module.
 *
 * @author Filip Maksimovic <filip.maksimovic@inria.fr>, Said Alvarado-Marin <said-alexander.alvarado-marin@inria.fr>
 *
 * @copyright Inria, 2022
 */
#include <stdio.h>
#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdbool.h>
#include <nrf.h>

#include "timer_hf.h"
#include "lh2.h"

//=========================== defines =========================================

#define SPIM3_INTERRUPT_PRIORITY 1   ///< Interrupt priority, as high as it will go
#define SPI3_BUFFER_SIZE         64  ///< Size of buffers used for SPI communications

#define LH2_D_PIN 29
#define LH2_E_PIN 30

#define FUZZY_CHIP 0xFF

#define LH2_LOCATION_ERROR_INDICATOR           0xFFFFFFFF
#define LH2_POLYNOMIAL_ERROR_INDICATOR         0xFF
#define POLYNOMIAL_BIT_ERROR_INITIAL_THRESHOLD 4
#define LH2_BUFFER_SIZE                        128
#define LH2_LOCATIONS_COUNT                    4
#define LH2_RESULTS_SIZE                       LH2_LOCATIONS_COUNT * 2

// gpiote definitions
#define GPIOTE_CH_OUT           0
#define GPIOTE_CH_IN_ENV_HiToLo 1
#define GPIOTE_CH_IN_ENV_LoToHi 2

#define OUTPUT_PIN_NUMBER 31
#define OUTPUT_PIN_PORT   0UL
#define INPUT_PIN_NUMBER  30
#define INPUT_PIN_PORT    0UL

// SPI pin definitions
#define FAKE_SCK_PIN 6  // NOTE: SPIM needs an SCK pin to be defined, otherwise it doesn't work. \
                        // nRF52840 P1.6 is used because it's not an available pin in the BCM module.

typedef struct {
    uint64_t bits_sweep;
    uint8_t  selected_polynomial;
    int32_t  bit_offset;
    uint32_t lfsr_location;
    uint32_t enveloppe_duration;
    uint8_t  buffer[LH2_BUFFER_SIZE];
} lh2_data_t;

typedef struct {
    uint8_t    transfer_counter;
    uint8_t    spi_rx_buffer[SPI3_BUFFER_SIZE];
    bool       buffers_ready;
    lh2_data_t data[LH2_LOCATIONS_COUNT];
    uint32_t   results[LH2_RESULTS_SIZE];
} lh2_vars_t;

//=========================== variables ========================================

static const uint32_t _end_buffers[4][16] = {
    {
        // p0
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b10101010110011101,  // 1/16 way through
        0b10001010101011010,  // 2/16 way through
        0b11001100100000010,  // 3/16 way through
        0b01100101100011111,  // 4/16 way through
        0b10010001101011110,  // 5/16 way through
        0b10100011001011111,  // 6/16 way through
        0b11110001010110001,  // 7/16 way through
        0b10111000110011011,  // 8/16 way through
        0b10100110100011110,  // 9/16 way through
        0b11001101100010000,  // 10/16 way through
        0b01000101110011111,  // 11/16 way through
        0b11100101011110101,  // 12/16 way through
        0b01001001110110111,  // 13/16 way through
        0b11011100110011101,  // 14/16 way through
        0b10000110101101011,  // 15/16 way through
    },
    {
        // p1
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b11010000110111110,  // 1/16 way through
        0b10110111100111100,  // 2/16 way through
        0b11000010101101111,  // 3/16 way through
        0b00101110001101110,  // 4/16 way through
        0b01000011000110100,  // 5/16 way through
        0b00010001010011110,  // 6/16 way through
        0b10100101111010001,  // 7/16 way through
        0b10011000000100001,  // 8/16 way through
        0b01110011011010110,  // 9/16 way through
        0b00100011101000011,  // 10/16 way through
        0b10111011010000101,  // 11/16 way through
        0b00110010100110110,  // 12/16 way through
        0b01000111111100110,  // 13/16 way through
        0b10001101000111011,  // 14/16 way through
        0b00111100110011100,  // 15/16 way through
    },
    {
        // p2
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b00011011011000100,  // 1/16 way through
        0b01011101010010110,  // 2/16 way through
        0b11001011001101010,  // 3/16 way through
        0b01110001111011010,  // 4/16 way through
        0b10110110011111010,  // 5/16 way through
        0b10110001110000001,  // 6/16 way through
        0b10001001011101001,  // 7/16 way through
        0b00000010011101011,  // 8/16 way through
        0b01100010101111011,  // 9/16 way through
        0b00111000001101111,  // 10/16 way through
        0b10101011100111000,  // 11/16 way through
        0b01111110101111111,  // 12/16 way through
        0b01000011110101010,  // 13/16 way through
        0b01001011100000011,  // 14/16 way through
        0b00010110111101110,  // 15/16 way through
    },
    {
        // p3
        0x00000000000000001,  // [0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1] starting seed, little endian
        0b11011011110010110,  // 1/16 way through
        0b11000100000001101,  // 2/16 way through
        0b11100011000010110,  // 3/16 way through
        0b00011111010001100,  // 4/16 way through
        0b11000001011110011,  // 5/16 way through
        0b10011101110001010,  // 6/16 way through
        0b00001011001111000,  // 7/16 way through
        0b00111100010000101,  // 8/16 way through
        0b01001111001010100,  // 9/16 way through
        0b01011010010110011,  // 10/16 way through
        0b11111101010001100,  // 11/16 way through
        0b00110101011011111,  // 12/16 way through
        0b01110110010101011,  // 13/16 way through
        0b00010000110100010,  // 14/16 way through
        0b00010111110101110,  // 15/16 way through
    },
};

static lh2_vars_t _lh2_vars;

// initialize LH2 demodulation variables
// bits sweep is the result of the demodulation, sweep_N indicates which SPI transfer those bits are associated with
static uint64_t LH2_bits_sweep_1 = 0;
static uint64_t LH2_bits_sweep_2 = 0;
static uint64_t LH2_bits_sweep_3 = 0;
static uint64_t LH2_bits_sweep_4 = 0;

// selected poly is the polyomial # (between 0 and 31) that the demodulation code thinks the demodulated bits are a part of, initialize to error state
static int LH2_selected_poly_1 = LH2_POLYNOMIAL_ERROR_INDICATOR;
static int LH2_selected_poly_2 = LH2_POLYNOMIAL_ERROR_INDICATOR;
static int LH2_selected_poly_3 = LH2_POLYNOMIAL_ERROR_INDICATOR;
static int LH2_selected_poly_4 = LH2_POLYNOMIAL_ERROR_INDICATOR;

// bit_offset indicates an offset between the start of the packet, as indicated by envelope dropping, and the 17-bit sequence that is verified to be in a known LFSR sequence
static int LH2_bit_offset_1 = 0;
static int LH2_bit_offset_2 = 0;
static int LH2_bit_offset_3 = 0;
static int LH2_bit_offset_4 = 0;

