DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
// LFSR location is the position in a given polynomial's LFSR that the decoded data is, initialize to error state
static uint32_t LH2_LFSR_location_1 = LH2_LOCATION_ERROR_INDICATOR;  // mark as all Fs, so that if the receiver gets a -1 (signed) it knows something went horribly wrong
static uint32_t LH2_LFSR_location_2 = LH2_LOCATION_ERROR_INDICATOR;
static uint32_t LH2_LFSR_location_3 = LH2_LOCATION_ERROR_INDICATOR;
static uint32_t LH2_LFSR_location_4 = LH2_LOCATION_ERROR_INDICATOR;

// initialize envelope duration storage variables
static uint32_t LH2_envelope_duration_1 = 0xFFFFFFFF;  // initialize to all 1s, error state
static uint32_t LH2_envelope_duration_2 = 0xFFFFFFFF;
static uint32_t LH2_envelope_duration_3 = 0xFFFFFFFF;
static uint32_t LH2_envelope_duration_4 = 0xFFFFFFFF;

// arrays of bits for local storage, contents of SPI transfer are copied into this
static uint8_t stored_buff_1[LH2_BUFFER_SIZE];
static uint8_t stored_buff_2[LH2_BUFFER_SIZE];
static uint8_t stored_buff_3[LH2_BUFFER_SIZE];
static uint8_t stored_buff_4[LH2_BUFFER_SIZE];

//=========================== prototypes =======================================

// these functions are called in the order written to perform the LH2 localization
void _initialize_ts4231(void);

uint64_t _demodulate_light(uint8_t *sample_buffer);

uint64_t _poly_check(uint32_t poly, uint32_t bits, uint8_t numbits);
uint8_t  _determine_polynomial(uint64_t chipsH1, int *start_val);

uint64_t _hamming_weight(uint64_t bits_in);

uint32_t _reverse_count_p0(uint32_t bits);
uint32_t _reverse_count_p1(uint32_t bits);
uint32_t _reverse_count_p2(uint32_t bits);
uint32_t _reverse_count_p3(uint32_t bits);

// setup the PPI
void _gpiote_setup(void);
void _ppi_setup(void);
void _spi3_setup(void);
void _timer2_setup(void);

// Said Set-Up
void _lh2_pin_set_input(uint8_t pin);
void _lh2_pin_set_output(uint8_t pin);

//=========================== public ===========================================

void db_lh2_init(void) {
    // Initialize the TS4231 on power-up - this is only necessary when power-cycling
    _initialize_ts4231();

    // Configure the necessary Pins in the GPIO peripheral  (MOSI and CS not needed)
    _lh2_pin_set_input(LH2_D_PIN);      // Data_pin will become the MISO pin
    _lh2_pin_set_output(FAKE_SCK_PIN);  // set SCK as Output.

    _spi3_setup();

    // Setup the LH2 local variables
    memset(_lh2_vars.spi_rx_buffer, 0, SPI3_BUFFER_SIZE);
    _lh2_vars.transfer_counter = 0;
    _lh2_vars.buffers_ready    = false;

    // Setup LH2 data
    for (uint8_t location = 0; location < LH2_LOCATIONS_COUNT; location++) {
        _lh2_vars.data[location].bits_sweep          = 0;
        _lh2_vars.data[location].selected_polynomial = LH2_POLYNOMIAL_ERROR_INDICATOR;
        _lh2_vars.data[location].bit_offset          = 0;
        _lh2_vars.data[location].lfsr_location       = LH2_LOCATION_ERROR_INDICATOR;
        _lh2_vars.data[location].enveloppe_duration  = 0xFFFFFFFF;
        memset(_lh2_vars.data[location].buffer, 0, LH2_BUFFER_SIZE);
    }

    // initialize GPIOTEs
    _gpiote_setup();
    // initialize timer(s)
    _timer2_setup();
    // initialize PPI
    _ppi_setup();
}

bool db_lh2_get_black_magic(void) {
    uint8_t i;
    uint8_t j;
    // invalid packet detection:
    int8_t invalid_packet_counter;

    if (_lh2_vars.buffers_ready) {
        _lh2_vars.buffers_ready = false;

        LH2_bits_sweep_1 = 0;
        LH2_bits_sweep_2 = 0;
        LH2_bits_sweep_3 = 0;
        LH2_bits_sweep_4 = 0;

        // perform the demodulation + poly search on the received packets
        // convert the SPI reading to bits via zero-crossing counter demodulation and differential/biphasic manchester decoding
        LH2_bits_sweep_1 = _demodulate_light(stored_buff_1);
        LH2_bits_sweep_2 = _demodulate_light(stored_buff_2);
        LH2_bits_sweep_3 = _demodulate_light(stored_buff_3);
        LH2_bits_sweep_4 = _demodulate_light(stored_buff_4);

        // figure out which polynomial each one of the two samples come from.
        LH2_selected_poly_1 = _determine_polynomial(LH2_bits_sweep_1, &LH2_bit_offset_1);
        LH2_selected_poly_2 = _determine_polynomial(LH2_bits_sweep_2, &LH2_bit_offset_2);
        LH2_selected_poly_3 = _determine_polynomial(LH2_bits_sweep_3, &LH2_bit_offset_3);
        LH2_selected_poly_4 = _determine_polynomial(LH2_bits_sweep_4, &LH2_bit_offset_4);

        if ((LH2_selected_poly_1 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_2 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_3 == LH2_POLYNOMIAL_ERROR_INDICATOR) |
            (LH2_selected_poly_4 == LH2_POLYNOMIAL_ERROR_INDICATOR)) {  // failure to find one of the two polynomials - start from scratch and grab another capture
            _lh2_vars.transfer_counter = 0;
            db_lh2_start_transfer();
            return false;
        } else {
            // find location of the first data set by counting the LFSR backwards
            if (LH2_selected_poly_1 == 0) {  // TODO: functionalize this nested if statement to clean up the main/applet code
                LH2_LFSR_location_1 = _reverse_count_p0(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 1) {
                LH2_LFSR_location_1 = _reverse_count_p1(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 2) {
                LH2_LFSR_location_1 = _reverse_count_p2(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            } else if (LH2_selected_poly_1 == 3) {
                LH2_LFSR_location_1 = _reverse_count_p3(LH2_bits_sweep_1 >> (47 - LH2_bit_offset_1)) - LH2_bit_offset_1;
            }
            // find location of the second data set
            if (LH2_selected_poly_2 == 0) {
                LH2_LFSR_location_2 = _reverse_count_p0(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 1) {
                LH2_LFSR_location_2 = _reverse_count_p1(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 2) {
                LH2_LFSR_location_2 = _reverse_count_p2(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            } else if (LH2_selected_poly_2 == 3) {
                LH2_LFSR_location_2 = _reverse_count_p3(LH2_bits_sweep_2 >> (47 - LH2_bit_offset_2)) - LH2_bit_offset_2;
            }

