DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
            // find location of the third data set
            if (LH2_selected_poly_3 == 0) {
                LH2_LFSR_location_3 = _reverse_count_p0(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 1) {
                LH2_LFSR_location_3 = _reverse_count_p1(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 2) {
                LH2_LFSR_location_3 = _reverse_count_p2(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            } else if (LH2_selected_poly_3 == 3) {
                LH2_LFSR_location_3 = _reverse_count_p3(LH2_bits_sweep_3 >> (47 - LH2_bit_offset_3)) - LH2_bit_offset_3;
            }

            // find location of the fourth data set
            if (LH2_selected_poly_4 == 0) {
                LH2_LFSR_location_4 = _reverse_count_p0(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 1) {
                LH2_LFSR_location_4 = _reverse_count_p1(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 2) {
                LH2_LFSR_location_4 = _reverse_count_p2(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            } else if (LH2_selected_poly_4 == 3) {
                LH2_LFSR_location_4 = _reverse_count_p3(LH2_bits_sweep_4 >> (47 - LH2_bit_offset_4)) - LH2_bit_offset_4;
            }
        }

        _lh2_vars.results[0] = (uint32_t)LH2_selected_poly_1;
        _lh2_vars.results[2] = (uint32_t)LH2_selected_poly_2;
        _lh2_vars.results[4] = (uint32_t)LH2_selected_poly_3;
        _lh2_vars.results[6] = (uint32_t)LH2_selected_poly_4;
        _lh2_vars.results[1] = LH2_LFSR_location_1;
        _lh2_vars.results[3] = LH2_LFSR_location_2;
        _lh2_vars.results[5] = LH2_LFSR_location_3;
        _lh2_vars.results[7] = LH2_LFSR_location_4;

        // detect invalid packets
        invalid_packet_counter = 0;
        for (i = 0; i < 7; i += 2) {
            if ((_lh2_vars.results[i] == 0) || (_lh2_vars.results[i] == 1)) {
                invalid_packet_counter++;  // from LHA
            } else if ((_lh2_vars.results[i] == 2) || (_lh2_vars.results[i] == 3)) {
                invalid_packet_counter--;  // from LHB
            }
        }
        if ((invalid_packet_counter == 1) || (invalid_packet_counter == -1)) {
            return false;  // odd # of packets from 1 LH, erroneous result
        }

        if ((invalid_packet_counter == 4) || (invalid_packet_counter == -4)) {
            // results from one LH2 were discovered - sort the two pairs
            if (LH2_LFSR_location_1 > LH2_LFSR_location_2) {
                _lh2_vars.results[0] = (uint32_t)LH2_selected_poly_2;
                _lh2_vars.results[2] = (uint32_t)LH2_selected_poly_1;
                _lh2_vars.results[1] = LH2_LFSR_location_2;
                _lh2_vars.results[3] = LH2_LFSR_location_1;
            } else {
                _lh2_vars.results[0] = (uint32_t)LH2_selected_poly_1;
                _lh2_vars.results[2] = (uint32_t)LH2_selected_poly_2;
                _lh2_vars.results[1] = LH2_LFSR_location_1;
                _lh2_vars.results[3] = LH2_LFSR_location_2;
            }
            if (LH2_LFSR_location_3 > LH2_LFSR_location_4) {
                _lh2_vars.results[0] = (uint32_t)LH2_selected_poly_4;
                _lh2_vars.results[2] = (uint32_t)LH2_selected_poly_3;
                _lh2_vars.results[1] = LH2_LFSR_location_4;
                _lh2_vars.results[3] = LH2_LFSR_location_3;
            } else {
                _lh2_vars.results[0] = (uint32_t)LH2_selected_poly_3;
                _lh2_vars.results[2] = (uint32_t)LH2_selected_poly_4;
                _lh2_vars.results[1] = LH2_LFSR_location_3;
                _lh2_vars.results[3] = LH2_LFSR_location_4;
            }
        }

        memset(stored_buff_1, 0, sizeof(stored_buff_1));
        memset(stored_buff_2, 0, sizeof(stored_buff_2));
        memset(stored_buff_3, 0, sizeof(stored_buff_3));
        memset(stored_buff_4, 0, sizeof(stored_buff_4));

        return true;
    }
    return false;
}

void db_lh2_get_current_location(uint32_t *position) {
    memcpy(position, _lh2_vars.results, 8 * sizeof(uint32_t));
}

void db_lh2_start_transfer(void) {
    _lh2_vars.transfer_counter = 0;
    NRF_PPI->CHENSET           = (PPI_CHENSET_CH2_Enabled << PPI_CHENSET_CH2_Pos) |
                       //(PPI_CHENSET_CH3_Enabled << PPI_CHENSET_CH3_Pos);
                       (PPI_CHENSET_CH4_Enabled << PPI_CHENSET_CH4_Pos) |
                       (PPI_CHENSET_CH5_Enabled << PPI_CHENSET_CH5_Pos);
}

void db_lh2_stop_transfer(void) {
    NRF_PPI->CHENCLR = (PPI_CHENCLR_CH2_Enabled << PPI_CHENCLR_CH2_Pos) |
                       //(PPI_CHENCLR_CH3_Enabled << PPI_CHENCLR_CH3_Pos);
                       (PPI_CHENCLR_CH4_Enabled << PPI_CHENCLR_CH4_Pos) |
                       (PPI_CHENCLR_CH5_Enabled << PPI_CHENCLR_CH5_Pos);  // stop receiving data while it thinks
}

//=========================== private ==========================================

/**
 * @brief wiggle the data and envelope lines in a magical way to configure the TS4231 to continuously read for LH2 sweep signals.
 *
 */
void _initialize_ts4231(void) {

    // Configure the wait timer
    db_timer_hf_init();

    // Filip's code define these pins as inputs, and then changes them quickly to outputs. Not sure why, but it works.
    _lh2_pin_set_input(LH2_D_PIN);
    _lh2_pin_set_input(LH2_E_PIN);

    // start the TS4231 initialization
    // Wiggle the Envelope and Data pins
    _lh2_pin_set_output(LH2_E_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_E_PIN;  // set pin HIGH
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_E_PIN;  // set pin LOW
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    _lh2_pin_set_output(LH2_D_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    // Turn the pins back to inputs
    _lh2_pin_set_input(LH2_D_PIN);
    _lh2_pin_set_input(LH2_E_PIN);
    // finally, wait 1 milisecond
    db_timer_hf_delay_us(1000);

    // Send the configuration magic number/sequence
    uint16_t config_val = 0x392B;
    // Turn the Data and Envelope lines back to outputs and clear them.
    _lh2_pin_set_output(LH2_E_PIN);
    _lh2_pin_set_output(LH2_D_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    // Send the magic configuration value, MSB first.
    for (uint8_t i = 0; i < 15; i++) {

        config_val = config_val << 1;
        if ((config_val & 0x8000) > 0) {
            NRF_P0->OUTSET = 1 << LH2_D_PIN;
        } else {
            NRF_P0->OUTCLR = 1 << LH2_D_PIN;
        }

        // Toggle the Envelope line as a clock.
        db_timer_hf_delay_us(10);
        NRF_P0->OUTSET = 1 << LH2_E_PIN;
        db_timer_hf_delay_us(10);
        NRF_P0->OUTCLR = 1 << LH2_E_PIN;
        db_timer_hf_delay_us(10);
    }
    // Finish send sequence and turn pins into inputs again.
    NRF_P0->OUTCLR = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    _lh2_pin_set_input(LH2_D_PIN);
    _lh2_pin_set_input(LH2_E_PIN);
    // Finish by waiting 10usec
    db_timer_hf_delay_us(10);

    // Now read back the sequence that the TS4231 answers.
    _lh2_pin_set_output(LH2_E_PIN);
    _lh2_pin_set_output(LH2_D_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    // Set Data pin as an input, to receive the data
    _lh2_pin_set_input(LH2_D_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTCLR = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    // Use the Envelope pin to output a clock while the data arrives.
    for (uint8_t i = 0; i < 14; i++) {
        NRF_P0->OUTSET = 1 << LH2_E_PIN;
        db_timer_hf_delay_us(10);
        NRF_P0->OUTCLR = 1 << LH2_E_PIN;
        db_timer_hf_delay_us(10);
    }

    // Finish the configuration procedure
    _lh2_pin_set_output(LH2_D_PIN);
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_E_PIN;
    db_timer_hf_delay_us(10);
    NRF_P0->OUTSET = 1 << LH2_D_PIN;
    db_timer_hf_delay_us(10);

