DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    while (shift_counter <= numbits) {
        bits_out    = bits_out << 1;        // shift left (forward in time) by 1
        masked_buff = ((buffer) & (poly));  // mask the buffer with the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ ((((masked_buff)) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        buffer = (buffer & 0x0000FFFF) << 1;
        buffer |= ((result) & (0x01));
        bits_out |= ((result) & (0x01));  // put result of the XOR operation into the new bit
        result = 0;
        shift_counter++;
    }
    return bits_out;
}

/**
 * @brief find out which LFSR polynomial the bit sequence is a member of
 *
 * @param[in] chipsH1: input sequences of bits from demodulation
 * @param[in] start_val: number of bits between the envelope falling edge and the beginning of the sequence where valid data has been found
 *
 * @return polynomial, indicating which polynomial was found, or FF for error (polynomial not found).
 */
uint8_t _determine_polynomial(uint64_t chipsH1, int *start_val) {
    // check which polynomial the bit sequence is part of
    // TODO: make function a void and modify memory directly
    // TODO: rename chipsH1 to something relevant... like bits?
    uint32_t poly0                               = 0b11101001001011000;
    uint32_t poly1                               = 0b10111111000000100;  // TODO: change this back to hex
    uint32_t poly2                               = 0x0001FF6B;
    uint32_t poly3                               = 0x00013F67;  // TODO: no more magic #s here, move this to #defines
    int32_t  bits_N_for_comp                     = 47;
    uint32_t bit_buffer1                         = (uint32_t)(((0xFFFF800000000000) & chipsH1) >> 47);
    uint64_t bits_from_poly[LH2_LOCATIONS_COUNT] = { 0 };
    uint64_t weights[LH2_LOCATIONS_COUNT]        = { 0xFFFFFFFFFFFFFFFF };
    uint8_t  selected_poly                       = LH2_POLYNOMIAL_ERROR_INDICATOR;  // initialize to error condition
    uint64_t bits_to_compare                     = 0;
    int32_t  threshold                           = POLYNOMIAL_BIT_ERROR_INITIAL_THRESHOLD;

    *start_val = 0;  // TODO: remove this? possible that I modify start value during the demodulation process

    // try polynomial vs. first buffer bits
    // this search takes 17-bit sequences and runs them forwards through the polynomial LFSRs.
    // if the remaining detected bits fit well with the chosen 17-bit sequence and a given polynomial, it is treated as "correct"
    // in case of bit errors at the beginning of the capture, the 17-bit sequence is shifted (to a max of 8 bits)
    // in case of bit errors at the end of the capture, the ending bits are removed (to a max of
    // removing bits reduces the threshold correspondingly, as incorrect packet detection will cause a significant delay in location estimate

    // run polynomial search on the first capture
    while (1) {
        // TODO: do this math stuff in multiple operations to: (a) make it readable (b) ensure order-of-execution
        bit_buffer1       = (uint32_t)(((0xFFFF800000000000 >> (*start_val)) & chipsH1) >> (64 - 17 - (*start_val)));
        bits_from_poly[0] = (((_poly_check(poly0, bit_buffer1, bits_N_for_comp)) << (64 - 17 - (*start_val) - bits_N_for_comp)) | (chipsH1 & (0xFFFFFFFFFFFFFFFF << (64 - (*start_val)))));
        bits_from_poly[1] = (((_poly_check(poly1, bit_buffer1, bits_N_for_comp)) << (64 - 17 - (*start_val) - bits_N_for_comp)) | (chipsH1 & (0xFFFFFFFFFFFFFFFF << (64 - (*start_val)))));
        bits_from_poly[2] = (((_poly_check(poly2, bit_buffer1, bits_N_for_comp)) << (64 - 17 - (*start_val) - bits_N_for_comp)) | (chipsH1 & (0xFFFFFFFFFFFFFFFF << (64 - (*start_val)))));
        bits_from_poly[3] = (((_poly_check(poly3, bit_buffer1, bits_N_for_comp)) << (64 - 17 - (*start_val) - bits_N_for_comp)) | (chipsH1 & (0xFFFFFFFFFFFFFFFF << (64 - (*start_val)))));
        bits_to_compare   = (chipsH1 & (0xFFFFFFFFFFFFFFFF << (64 - 17 - (*start_val) - bits_N_for_comp)));
        weights[0]        = _hamming_weight(bits_from_poly[0] ^ bits_to_compare);
        weights[1]        = _hamming_weight(bits_from_poly[1] ^ bits_to_compare);
        weights[2]        = _hamming_weight(bits_from_poly[2] ^ bits_to_compare);
        weights[3]        = _hamming_weight(bits_from_poly[3] ^ bits_to_compare);
        if (bits_N_for_comp < 10) {                          // too few bits to reliably compare, give up
            selected_poly = LH2_POLYNOMIAL_ERROR_INDICATOR;  // mark the poly as "wrong"
            break;
        }  // TODO: implement sorting network for efficiency?
        if ((weights[0] <= threshold) | (weights[1] <= threshold) | (weights[2] <= threshold) | (weights[3] <= threshold)) {
            if ((weights[0] < weights[1]) & (weights[0] < weights[2]) & (weights[0] < weights[3])) {  // weight0 is the smallest
                selected_poly = 0;
                break;
            } else if ((weights[1] < weights[0]) & (weights[1] < weights[2]) & (weights[1] < weights[3])) {  // weight1 is the smallest
                selected_poly = 1;
                break;
            } else if ((weights[2] < weights[0]) & (weights[2] < weights[1]) & (weights[2] < weights[3])) {  // weight2 is the smallest
                selected_poly = 2;
                break;
            } else if ((weights[3] < weights[0]) & (weights[3] < weights[1]) & (weights[3] < weights[2])) {  // weight3 is the smallest
                selected_poly = 3;
                break;
            }
        } else if (*start_val > 8) {  // match failed, try again removing bits from the end
            *start_val      = 0;
            bits_N_for_comp = bits_N_for_comp + 1;
            if (threshold > 1) {
                threshold = threshold - 1;
            } else if (threshold == 1) {  // keep threshold at ones, but you're probably screwed with an unlucky bit error
                threshold = 1;
            }
        } else {
            *start_val      = *start_val + 1;
            bits_N_for_comp = bits_N_for_comp - 1;
        }
    }
    return selected_poly;
}

/**
 * @brief counts the number of 1s in a 64-bit
 *
 * @param bits_in, arbitrary bits
 *
 * @return cumulative number of 1s inside of bits_in
 */
uint64_t _hamming_weight(uint64_t bits_in) {  // TODO: bad name for function? or is it, it might be a good name for a function, because it describes exactly what it does
    uint64_t weight = bits_in;
    weight          = weight - ((weight >> 1) & 0x5555555555555555);                         // find # of 1s in every 2-bit block
    weight          = (weight & 0x3333333333333333) + ((weight >> 2) & 0x3333333333333333);  // find # of 1s in every 4-bit block
    weight          = (weight + (weight >> 4)) & 0x0F0F0F0F0F0F0F0F;                         // find # of 1s in every 8-bit block
    weight          = (weight + (weight >> 8)) & 0x00FF00FF00FF00FF;                         // find # of 1s in every 16-bit block
    weight          = (weight + (weight >> 16)) & 0x0000FFFF0000FFFF;                        // find # of 1s in every 32-bit block
    weight          = (weight + (weight >> 32));                                             // add the two 32-bit block results together
    weight          = weight & 0x000000000000007F;                                           // mask final result, max value of 64, 0'b01000000
    return weight;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial0 with initial seed 1
 *
 * @param bits: 17-bit sequence
 *
 * @return count: location of the sequence
 */
uint32_t _reverse_count_p0(uint32_t bits) {
    uint32_t count       = 0;
    uint32_t buffer      = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked
    uint8_t  ii          = 0;                   // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b11101001001011000;
    while (buffer != _end_buffers[0][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[0][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[0][0];
        }
        if ((buffer ^ _end_buffers[0][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[0][0];
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial1 with initial seed 1
 *
 * @param bits: 17-bit sequence

 * @return count: location of the sequence
*/
uint32_t _reverse_count_p1(uint32_t bits) {
    uint32_t count  = 0;
    uint32_t buffer = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked

    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b10111111000000100;
    while (buffer != _end_buffers[1][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[1][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[1][0];
        }
        if ((buffer ^ _end_buffers[1][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[1][0];
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial2 with initial seed 1
 *
 * @param bits: 17-bit sequence
 *
 * @return count: location of the sequence
 */
uint32_t _reverse_count_p2(uint32_t bits) {
    uint32_t count  = 0;
    uint32_t buffer = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked

    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b11111111101101011;
    while (buffer != _end_buffers[2][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[2][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[2][0];
        }
        if ((buffer ^ _end_buffers[2][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[2][0];
        }
    }
    return count;
}

/**
 * @brief finds the position of a 17-bit sequence (bits) in the sequence generated by polynomial3 with initial seed 1
 *
 * @param bits: 17-bit sequence
 *
 * @return count: location of the sequence
 */
uint32_t _reverse_count_p3(uint32_t bits) {
    uint32_t count  = 0;
    uint32_t buffer = bits & 0x0001FFFFF;  // initialize buffer to initial bits, masked

    uint8_t  ii          = 0;  // loop variable for cumulative sum
    uint32_t result      = 0;
    uint32_t b17         = 0;
    uint32_t masked_buff = 0;
    uint32_t poly        = 0b10011111101100111;
    while (buffer != _end_buffers[3][0])  // do until buffer reaches one of the saved states
    {
        b17         = buffer & 0x00000001;           // save the "newest" bit of the buffer
        buffer      = (buffer & (0x0001FFFE)) >> 1;  // shift the buffer right, backwards in time
        masked_buff = (buffer) & (poly);             // mask the buffer w/ the selected polynomial
        for (ii = 0; ii < 17; ii++) {
            result = result ^ (((masked_buff) >> ii) & (0x00000001));  // cumulative sum of buffer&poly
        }
        result = result ^ b17;
        buffer = buffer | (result << 16);  // update buffer w/ result
        result = 0;                        // reset result
        count++;
        if ((buffer ^ _end_buffers[3][1]) == 0x00000000) {
            count  = count + 8192 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][2]) == 0x00000000) {
            count  = count + 16384 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][3]) == 0x00000000) {
            count  = count + 24576 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][4]) == 0x00000000) {
            count  = count + 32768 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][5]) == 0x00000000) {
            count  = count + 40960 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][6]) == 0x00000000) {
            count  = count + 49152 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][7]) == 0x00000000) {
            count  = count + 57344 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][8]) == 0x00000000) {
            count  = count + 65536 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][9]) == 0x00000000) {
            count  = count + 73728 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][10]) == 0x00000000) {
            count  = count + 81920 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][11]) == 0x00000000) {
            count  = count + 90112 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][12]) == 0x00000000) {
            count  = count + 98304 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][13]) == 0x00000000) {
            count  = count + 106496 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][14]) == 0x00000000) {
            count  = count + 114688 - 1;
            buffer = _end_buffers[3][0];
        }
        if ((buffer ^ _end_buffers[3][15]) == 0x00000000) {
            count  = count + 122880 - 1;
            buffer = _end_buffers[3][0];
        }
    }
    return count;
}

/**
 * @brief Set a pin of port 0 as an INPUT with no pull-up or pull-down
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void _lh2_pin_set_input(uint8_t pin) {

    // Configure Data pin as INPUT, with no pullup or pull down.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Input << GPIO_PIN_CNF_DIR_Pos) |
                           (GPIO_PIN_CNF_INPUT_Connect << GPIO_PIN_CNF_INPUT_Pos) |
                           (GPIO_PIN_CNF_PULL_Disabled << GPIO_PIN_CNF_PULL_Pos);
}

/**
 * @brief Set a pin of port 0 as an OUTPUT with standard drive
 * @param[in] pin: port 0 pin to configure as input [0-31]
 *
 */
void _lh2_pin_set_output(uint8_t pin) {

    // Configure Data pin as OUTPUT, with standar power drive current.
    NRF_P0->PIN_CNF[pin] = (GPIO_PIN_CNF_DIR_Output << GPIO_PIN_CNF_DIR_Pos) |   // Set Pin as output
                           (GPIO_PIN_CNF_DRIVE_S0S1 << GPIO_PIN_CNF_DRIVE_Pos);  // Activate high current gpio mode.
}

/**
 * @brief set-up GPIOTE so that events are configured for falling (GPIOTE_CH_IN) and rising edges (GPIOTE_CH_IN_ENV_HiToLo) of the envelope signal
 *
 */
void _gpiote_setup(void) {

