DotBots/DotBot-firmware/bsp/nrf52833/lh2.c
    // NRF_GPIOTE->CONFIG[GPIOTE_CH_OUT] =           (GPIOTE_CONFIG_MODE_Task        << GPIOTE_CONFIG_MODE_Pos) | // TODO: remove this event, it exists for debug purposes
    //                                               (OUTPUT_PIN_NUMBER              << GPIOTE_CONFIG_PSEL_Pos) |
    //                                               (OUTPUT_PIN_PORT                << GPIOTE_CONFIG_PORT_Pos) |
    //                                               (GPIOTE_CONFIG_POLARITY_Toggle  << GPIOTE_CONFIG_POLARITY_Pos) |
    //                                               (GPIOTE_CONFIG_OUTINIT_High     << GPIOTE_CONFIG_OUTINIT_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_HiToLo] = (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) |
                                                  (INPUT_PIN_NUMBER << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_HiToLo << GPIOTE_CONFIG_POLARITY_Pos);

    NRF_GPIOTE->CONFIG[GPIOTE_CH_IN_ENV_LoToHi] = (GPIOTE_CONFIG_MODE_Event << GPIOTE_CONFIG_MODE_Pos) |
                                                  (INPUT_PIN_NUMBER << GPIOTE_CONFIG_PSEL_Pos) |
                                                  (INPUT_PIN_PORT << GPIOTE_CONFIG_PORT_Pos) |
                                                  (GPIOTE_CONFIG_POLARITY_LoToHi << GPIOTE_CONFIG_POLARITY_Pos);
}

// setup the PPI
/**
 * @brief start SPI3 at falling edge of envelope, start timer2 at falling edge of envelope, stop/capture timer2 at rising edge of envelope
 *
 */
void _ppi_setup(void) {
    // uint32_t gpiote_output_task_addr  = (uint32_t)&NRF_GPIOTE->TASKS_OUT[GPIOTE_CH_OUT];
    uint32_t gpiote_input_task_addr   = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_HiToLo];
    uint32_t envelope_input_LoToHi    = (uint32_t)&NRF_GPIOTE->EVENTS_IN[GPIOTE_CH_IN_ENV_LoToHi];
    uint32_t spi3_start_task_addr     = (uint32_t)&NRF_SPIM3->TASKS_START;
    uint32_t spi3_stop_task_addr      = (uint32_t)&NRF_SPIM3->TASKS_STOP;
    uint32_t timer2_start_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_START;
    uint32_t timer2_stop_task_addr    = (uint32_t)&NRF_TIMER2->TASKS_STOP;
    uint32_t timer2_capture_task_addr = (uint32_t)&NRF_TIMER2->TASKS_CAPTURE[0];
    uint32_t timer2_clear_task_addr   = (uint32_t)&NRF_TIMER2->TASKS_CLEAR;

    NRF_PPI->CH[2].EEP   = gpiote_input_task_addr;  // envelope down
    NRF_PPI->CH[2].TEP   = spi3_start_task_addr;    // start spi3 transfer
    NRF_PPI->FORK[2].TEP = timer2_start_task_addr;  // start timer

    // NRF_PPI->CH[3].EEP    = gpiote_input_task_addr;
    // NRF_PPI->CH[3].TEP    = gpiote_output_task_addr;

    NRF_PPI->CH[4].EEP   = envelope_input_LoToHi;     // envelope up, finished lh2 data
    NRF_PPI->CH[4].TEP   = timer2_capture_task_addr;  // get time it took
    NRF_PPI->FORK[4].TEP = timer2_stop_task_addr;     // stop timer

    NRF_PPI->CH[5].EEP   = envelope_input_LoToHi;
    NRF_PPI->CH[5].TEP   = timer2_clear_task_addr;  // clear timer
    NRF_PPI->FORK[5].TEP = spi3_stop_task_addr;     // stop spi3 transfer
}

void _spi3_setup(void) {
    // Define the necessary Pins in the SPIM peripheral
    NRF_SPIM3->PSEL.MISO = LH2_D_PIN << SPIM_PSEL_MISO_PIN_Pos |                            // Define pin number for MISO pin
                           0 << SPIM_PSEL_MISO_PORT_Pos |                                   // Define pin port for MISO pin
                           SPIM_PSEL_MISO_CONNECT_Connected << SPIM_PSEL_MISO_CONNECT_Pos;  // Enable the MISO pin

    NRF_SPIM3->PSEL.SCK = FAKE_SCK_PIN << SPIM_PSEL_SCK_PIN_Pos |                        // Define pin number for SCK pin
                          1 << SPIM_PSEL_SCK_PORT_Pos |                                  // Define pin port for SCK pin
                          SPIM_PSEL_SCK_CONNECT_Connected << SPIM_PSEL_SCK_CONNECT_Pos;  // Enable the SCK pin

    NRF_SPIM3->PSEL.MOSI = (4UL) << SPIM_PSEL_MOSI_PIN_Pos |
                           1 << SPIM_PSEL_MOSI_PORT_Pos |
                           SPIM_PSEL_MOSI_CONNECT_Connected << SPIM_PSEL_MOSI_CONNECT_Pos;

    // Configure the Interruptions
    NVIC_ClearPendingIRQ(SPIM3_IRQn);
    NVIC_DisableIRQ(SPIM3_IRQn);  // Disable interruptions while configuring

    // Configure the SPIM peripheral
    NRF_SPIM3->FREQUENCY = SPIM_FREQUENCY_FREQUENCY_M32;                         // Set SPI frequency to 32MHz
    NRF_SPIM3->CONFIG    = SPIM_CONFIG_ORDER_MsbFirst << SPIM_CONFIG_ORDER_Pos;  // Set MsB out first

    // Configure the EasyDMA channel, only using RX
    NRF_SPIM3->RXD.MAXCNT = SPI3_BUFFER_SIZE;                   // Set the size of the input buffer.
    NRF_SPIM3->RXD.PTR    = (uint32_t)_lh2_vars.spi_rx_buffer;  // Set the input buffer pointer.

    NRF_SPIM3->INTENSET = SPIM_INTENSET_END_Enabled << SPIM_INTENSET_END_Pos;  // Enable interruption for when a packet arrives
    NVIC_SetPriority(SPIM3_IRQn, SPIM3_INTERRUPT_PRIORITY);                    // Set priority for Radio interrupts to 1
    // Enable SPIM interruptions
    NVIC_EnableIRQ(SPIM3_IRQn);

    // Enable the SPIM peripheral
    NRF_SPIM3->ENABLE = SPIM_ENABLE_ENABLE_Enabled << SPIM_ENABLE_ENABLE_Pos;
}

/**
 * @brief timer2 setup, in _ppi_setup() this timer will CLEAR/START at falling edge of envelop signal and STOP/CAPTURE at rising edge of envelope signal
 *
 */
void _timer2_setup(void) {
    NRF_TIMER2->BITMODE   = TIMER_BITMODE_BITMODE_32Bit;
    NRF_TIMER2->PRESCALER = (0UL);  // 16 MHz clock counter

    // timer will START at falling edge of the envelope signal
    // timer will STOP at rising edge of the envelope signal
    // it is the processor's responsibility to read this timer's count value and reset it
}

//=========================== interrupts =======================================

/**
 * @brief SPIM3 interrupt handler
 *
 */
void SPIM3_IRQHandler(void) {
    // Check if the interrupt was caused by a fully send package
    if (NRF_SPIM3->EVENTS_END) {
        // Clear the Interrupt flag
        NRF_SPIM3->EVENTS_END = 0;
        _lh2_vars.transfer_counter++;
        // load global SPI buffer (_lh2_vars.spi_rx_buffer) into four local arrays (stored_buff_1 ... stored_buff_4)
        if (_lh2_vars.transfer_counter == 1) {
            memcpy(stored_buff_1, _lh2_vars.spi_rx_buffer, SPI3_BUFFER_SIZE);
            LH2_envelope_duration_1 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 2) {
            memcpy(stored_buff_2, _lh2_vars.spi_rx_buffer, SPI3_BUFFER_SIZE);
            LH2_envelope_duration_2 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 3) {
            memcpy(stored_buff_3, _lh2_vars.spi_rx_buffer, SPI3_BUFFER_SIZE);
            LH2_envelope_duration_3 = NRF_TIMER2->CC[0];
        } else if (_lh2_vars.transfer_counter == 4) {
            memcpy(stored_buff_4, _lh2_vars.spi_rx_buffer, SPI3_BUFFER_SIZE);
            LH2_envelope_duration_4 = NRF_TIMER2->CC[0];
            _lh2_vars.buffers_ready = true;
        }
    }
}
